# მომხმარებლიდან ორი რიცხვის მიღება
num1 = float(input("77"))
num2 = float(input("69"))

# მათემატიკური ოპერაციები
addition = num1 + num2
subtraction = num1 - num2
multiplication = num1 * num2
if num2 != 0:
    division = num1 / num2
else:
    division = "ვერ გაყოფთ ნულზე"

# შედეგების გამოტანა
print(f"დამატება: {addition}")
print(f"გამოკლება: {subtraction}")
print(f"გამრავლება: {multiplication}")
print(f"გაყოფა: {division}")



# კონკატენაცია (Concatenation) არის პროცესის სახელი, როდესაც ორ ან მეტ სტრინგს ვაერთებთ ერთმანეთთან.
# ეს ხდება "+" ოპერატორის გამოყენებით.
# მაგალითად:
string1 = "გამარჯობა"
string2 = "მსოფლიო"
result = string1 + " " + string2  # აქ ვაერთებთ string1-ს, სიცარიელეს (" ") და string2-ს
print(result)  # შედეგი იქნება: "გამარჯობა მსოფლიო"



# int() და float() ფუნქციები გამოიყენება მონაცემთა ტიპების გადასაყვანად რიცხვებად:

# int():
# ეს ფუნქცია ცვლის მონაცემებს მთელ რიცხვად (integer).
# მაგალითად, სტრინგი ან ათწილადი რიცხვი შეიძლება გადაიქცეს მთელ რიცხვად,

# float():
# ეს ფუნქცია ცვლის მონაცემებს ათწილად რიცხვად (floating-point number).
# მაგალითად, სტრინგი ან მთელი რიცხვი შეიძლება გადაიქცეს ათწილად რიცხვად.

# ამ ფუნქციების გამოყენება საჭიროა, როდესაც გსურთ მონაცემთა ტიპების კონტროლი,
